*** =for= 语句
     - Python的for语句按照它们在序列中出现的顺序遍历每一个序列（列表或字符串）的项目。


#+BEGIN_SRC python :results output :exports both
words = ["cat", 'window', 'defenestrate']
for w in words:
    print(w, len(w))
""""""
#+END_SRC

#+RESULTS:
: cat 3
: window 6
: defenestrate 12

